abstractsig/io_cc2652/io_cpu.h
/*
 *
 * io cpu
 *
 */
#ifndef io_cpu_H_
#define io_cpu_H_
#include <io_core.h>

//
// power domain
//

typedef struct PACK_STRUCTURE io_cc2652_cpu_power_domain {
    IO_CPU_POWER_DOMAIN_STRUCT_MEMBERS
    uint32_t prcm_domain_identifier;
} io_cc2652_cpu_power_domain_t;

extern io_cc2652_cpu_power_domain_t peripheral_power_domain;

//
// inline io power domain implementation
//
INLINE_FUNCTION void
turn_on_io_power_domain (io_t* io,io_cpu_power_domain_pointer_t pd) {
	return io_cpu_power_domain_ro_pointer(pd)->implementation->turn_on(io,pd);
}

INLINE_FUNCTION void
turn_off_io_power_domain (io_t* io,io_cpu_power_domain_pointer_t pd) {
	return io_cpu_power_domain_ro_pointer(pd)->implementation->turn_off(io,pd);
}

//
// clocks
//
typedef struct PACK_STRUCTURE cc2652_hf_rc_oscillator {
	IO_CPU_CLOCK_SOURCE_STRUCT_MEMBERS
} cc2652_hf_rc_oscillator_t;
extern EVENT_DATA io_cpu_clock_implementation_t cc2652_hf_rc_48_oscillator_implementation;
extern EVENT_DATA io_cpu_clock_implementation_t cc2652_hf_rc_24_oscillator_implementation;

INLINE_FUNCTION bool
cpu_clock_is_cc2652_hf_rc_oscillator (io_cpu_clock_pointer_t clock) {
	return io_cpu_clock_has_implementation (clock,&cc2652_hf_rc_48_oscillator_implementation);
}

typedef struct PACK_STRUCTURE cc2652_hp_oscillator {
	IO_CPU_CLOCK_SOURCE_STRUCT_MEMBERS
	float64_t frequency;
} cc2652_hp_oscillator_t;
extern EVENT_DATA io_cpu_clock_implementation_t cc2652_hp_oscillator_implementation;

INLINE_FUNCTION bool
cpu_clock_is_cc2652_hp_oscillator (io_cpu_clock_pointer_t clock) {
	return io_cpu_clock_has_implementation (clock,&cc2652_hp_oscillator_implementation);
}

typedef struct PACK_STRUCTURE cc2652_sclk_lf {
	IO_CPU_CLOCK_FUNCTION_STRUCT_MEMBERS
} cc2652_sclk_lf_t;
extern EVENT_DATA io_cpu_clock_implementation_t cc2652_sclk_lf_implementation;

typedef struct cc2652_core_clock {
	IO_CPU_DEPENDANT_CLOCK_STRUCT_MEMBERS
} cc2652_core_clock_t;
extern EVENT_DATA io_cpu_clock_implementation_t cc2652_core_clock_implementation;

typedef struct cc2652_rtc_clock {
	IO_CPU_DEPENDANT_CLOCK_STRUCT_MEMBERS
} cc2652_rtc_clock_t;
extern EVENT_DATA io_cpu_clock_implementation_t cc2652_rtc_clock_implementation;

typedef struct cc2652_peripheral_clock {
	IO_CPU_DEPENDANT_CLOCK_STRUCT_MEMBERS
	uint32_t prcm_peripheral_id;
} cc2652_peripheral_clock_t;
extern EVENT_DATA io_cpu_clock_implementation_t cc2652_peripheral_clock_implementation;
extern EVENT_DATA io_cpu_clock_implementation_t cc2652_serial_clock_implementation;

//
// pins
//

typedef union PACK_STRUCTURE {
	io_pin_t io;
	uint32_t u32;
	struct PACK_STRUCTURE {
		uint32_t	number:6;
		uint32_t ioc_port_id:6;
		uint32_t active_level:1;
		uint32_t initial_state:1;
		uint32_t pull_mode:2;
		uint32_t drive_level:3;
		uint32_t hysteresis:1;
		uint32_t :12;
	} cc;
} cc2652_io_pin_t;

#define cc2652_io_pin_number(pin)				(pin).cc.number
#define cc2652_io_pin_pull_mode(pin)			(pin).cc.pull_mode
#define cc2652_io_pin_active_level(pin)		(pin).cc.active_level
#define cc2652_io_pin_initial_state(pin)		(pin).cc.initial_state
#define cc2652_io_pin_ioc_port_id(pin)			(pin).cc.ioc_port_id

#define IO_PIN_ACTIVE_LEVEL_HIGH		1
#define IO_PIN_ACTIVE_LEVEL_LOW		0

#define IO_PIN_LEVEL_ACTIVE			1
#define IO_PIN_LEVEL_INACTIVE			0

#define IO_PIN_NO_PULL		0		//	IOC_NO_IOPULL
#define IO_PIN_PULL_UP		1		// IOC_IOPULL_UP
#define IO_PIN_PULL_DOWN	2		// IOC_IOPULL_DOWN

#define def_cc2652_io_input_pin(pin_number,active,pull) (cc2652_io_pin_t) {\
		.cc.number = pin_number,\
		.cc.active_level = active,\
		.cc.initial_state = IO_PIN_LEVEL_INACTIVE,\
		.cc.pull_mode = pull,\
		.cc.drive_level = 0,\
		.cc.hysteresis = 0,\
		.cc.ioc_port_id = IOC_PORT_GPIO,\
	}

#define def_cc2652_io_output_pin(pin_number,active,initial) (cc2652_io_pin_t) {\
		.cc.number = pin_number,\
		.cc.active_level = active,\
		.cc.initial_state = initial,\
		.cc.pull_mode = IO_PIN_NO_PULL,\
		.cc.drive_level = 0,\
		.cc.hysteresis = 0,\
		.cc.ioc_port_id = IOC_PORT_GPIO,\
	}

#define def_cc2652_io_alternate_pin(pin_number,active,IOC) (cc2652_io_pin_t) {\
		.cc.number = pin_number,\
		.cc.active_level = active,\
		.cc.initial_state = IO_PIN_LEVEL_INACTIVE,\
		.cc.pull_mode = IO_PIN_NO_PULL,\
		.cc.drive_level = 0,\
		.cc.hysteresis = 0,\
		.cc.ioc_port_id = IOC,\
	}

#define CC2652_INVALID_PIN_NUMBER	0x3f

#define def_cc2652_null_io_pin() (cc2652_io_pin_t) {\
		.cc.number = CC2652_INVALID_PIN_NUMBER,\
		.cc.active_level = IO_PIN_ACTIVE_LEVEL_HIGH,\
		.cc.initial_state = IO_PIN_LEVEL_INACTIVE,\
		.cc.pull_mode = IO_PIN_NO_PULL,\
		.cc.drive_level = 0,\
		.cc.hysteresis = 0,\
		.cc.ioc_port_id = IOC_PORT_GPIO,\
	}

typedef struct PACK_STRUCTURE cc2652_time_clock {

	io_cpu_clock_pointer_t clock;
	io_event_t alarm;
	io_t *io;
	
} cc2652_time_clock_t;

//
// cpu
//
#define CC2652_IO_CPU_STRUCT_MEMBERS \
	IO_STRUCT_MEMBERS				\
	io_value_memory_t *vm;\
	io_byte_memory_t *bm;\
	uint32_t in_event_thread;\
	io_value_pipe_t *tasks;\
	io_cpu_clock_pointer_t gpio_clock; \
	uint32_t prbs_state[4]; \
	cc2652_time_clock_t rtc;\
	uint32_t first_run;\
	/**/

typedef struct PACK_STRUCTURE io_cc2652_cpu {
	CC2652_IO_CPU_STRUCT_MEMBERS
} io_cc2652_cpu_t;

void	initialise_cpu_io (io_t*);

//
// sockets
//

typedef struct PACK_STRUCTURE cc2652_uart {
	IO_SOCKET_STRUCT_MEMBERS
	
	io_t *io;
	io_encoding_implementation_t const *encoding;
	io_cpu_clock_pointer_t peripheral_clock;

	io_encoding_pipe_t *tx_pipe;
	io_event_t transmit_complete;
	io_byte_pipe_t *rx_pipe;

	cc2652_io_pin_t tx_pin;
	cc2652_io_pin_t rx_pin;
	cc2652_io_pin_t rts_pin;
	cc2652_io_pin_t cts_pin;
	
	uint32_t register_base_address;
	int32_t interrupt_number;
	uint32_t baud_rate;

} cc2652_uart_t;

#ifdef IMPLEMENT_IO_CPU
//-----------------------------------------------------------------------------
//
// cc2652 Implementtaion
//
//-----------------------------------------------------------------------------
#include <cc2652rb.h>

//
// because ti SDK does not follow cmsis convention for rnterrupt numbering
//
typedef int32_t IRQn_Type;
#define SysTick_IRQn (INT_SYSTICK - 16)
#define CMSIS_IRQn(N)	((int32_t)(N) - 16)
#include <cmsis/core_cm4.h>

#define NUMBER_OF_ARM_INTERRUPT_VECTORS	16L
#define NUMBER_OF_NRF_INTERRUPT_VECTORS	NUM_INTERRUPTS
#define NUMBER_OF_INTERRUPT_VECTORS	(NUMBER_OF_ARM_INTERRUPT_VECTORS + NUMBER_OF_NRF_INTERRUPT_VECTORS)

static io_interrupt_handler_t cpu_interrupts[NUMBER_OF_INTERRUPT_VECTORS];

#define ENABLE_INTERRUPTS	\
	do {	\
		__DMB();	\
		__enable_irq();	\
	} while (0)

#define DISABLE_INTERRUPTS	\
	do {	\
		__disable_irq();	\
		__DMB();	\
	} while (0)


