abstractsig/io_cc2652/io_cpu.h
/*
 *-----------------------------------------------------------------------------
 *
 * the initial io state settings
 *
 *-----------------------------------------------------------------------------
 */
static PERSISTANT_MEMORY_SECTION io_persistant_state_t io_config = {
	.first_run_flag = IO_FIRST_RUN_SET,
	.power_cycles = 0,
	.uid = {{0}},
	.secret = {{0}},
	.shared = {{0}},
};

/*
 *
 *  When updating the Flash, the VIMS (Vesatile Instruction Memory System)
 *  mode must be set to GPRAM or OFF, before programming, and both VIMS
 *  flash line buffers must be set to disabled.
 *
 */
static uint8_t
disableFlashCache(void) {
	uint8_t mode = VIMSModeGet(VIMS_BASE);

	VIMSLineBufDisable(VIMS_BASE);

	if (mode != VIMS_MODE_DISABLED) {
		VIMSModeSet(VIMS_BASE, VIMS_MODE_DISABLED);
		while (VIMSModeGet(VIMS_BASE) != VIMS_MODE_DISABLED);
	}

	return (mode);
}

static void
restoreFlashCache(uint8_t mode) {
	if (mode != VIMS_MODE_DISABLED) {
		VIMSModeSet(VIMS_BASE, VIMS_MODE_ENABLED);
	}

	VIMSLineBufEnable(VIMS_BASE);
}

static bool
cc2652io_config_clear_first_run (void) {
	if (io_config.first_run_flag == IO_FIRST_RUN_SET) {
		io_persistant_state_t new_ioc = io_config;
		uint8_t mode = disableFlashCache ();
		uint32_t sector_address = (uint32_t) &io_config;
		
		DISABLE_INTERRUPTS;
		
		new_ioc.first_run_flag = IO_FIRST_RUN_CLEAR;

		if (FlashProtectionGet (sector_address) == FLASH_NO_PROTECT) {
			FlashSectorErase (sector_address);			
			FlashProgram (
				(uint8_t*) &new_ioc,sector_address,sizeof(io_persistant_state_t)
			);
		}
		
		sector_address = FlashCheckFsmForError ();
		
		restoreFlashCache (mode);
		
		ENABLE_INTERRUPTS;
		
		return memcmp (&new_ioc,&io_config,sizeof(io_persistant_state_t)) == 0;
	} else {
		return true;
	}
}

static bool
cc2652_io_config_is_first_run (void) {
	bool first = (io_config.first_run_flag == IO_FIRST_RUN_SET);
	cc2652io_config_clear_first_run ();
	return first;
}

static io_uid_t const*
cc2652_get_uid (io_t *io) {
	return &io_config.uid;
}

bool
cc2652_is_first_run (io_t *io) {
	io_cc2652_cpu_t *this = (io_cc2652_cpu_t*) io;
	return this->first_run;
}

static void
null_interrupt_handler (void *w) {
	while(1);
}

//
// power domains
//

bool
controlled_power_domain_turn_on (io_cpu_power_domain_pointer_t pd) {
	io_cc2652_cpu_power_domain_t const *this = (io_cc2652_cpu_power_domain_t const *) (
		io_cpu_power_domain_ro_pointer (pd)
	);
	
	if (PRCMPowerDomainStatus(this->prcm_domain_identifier) == PRCM_DOMAIN_POWER_OFF) {
	  PRCMPowerDomainOn (this->prcm_domain_identifier);
	  while(PRCMPowerDomainStatus(this->prcm_domain_identifier) != PRCM_DOMAIN_POWER_ON);
	  PRCMLoadSet();
	}

	if (io_cpu_power_domain_rw_pointer (pd)) {
		io_cpu_power_domain_rw_pointer(pd)->reference_count ++;
	}
	
	return true;
}

EVENT_DATA io_cpu_power_domain_implementation_t
cpu_core_power_domain_implementation = {
	.turn_off = io_power_domain_no_operation,
	.turn_on = io_power_domain_no_operation,
};

EVENT_DATA io_cpu_power_domain_implementation_t
bus_power_domain_implementation = {
	.turn_off = io_power_domain_no_operation,
	.turn_on = io_power_domain_no_operation,
};

static void
turn_peripheral_power_domain_on (io_t *io,io_cpu_power_domain_pointer_t pd) {
	controlled_power_domain_turn_on (pd);
}

EVENT_DATA io_cpu_power_domain_implementation_t
peripheral_power_domain_implementation = {
	.turn_off = io_power_domain_no_operation,
	.turn_on = turn_peripheral_power_domain_on,
};

EVENT_DATA io_cpu_power_domain_implementation_t
radio_power_domain_implementation = {
	.turn_off = io_power_domain_no_operation,
	.turn_on = io_power_domain_no_operation,
};

static void
turn_serial_power_domain_on (io_t *io,io_cpu_power_domain_pointer_t pd) {
	controlled_power_domain_turn_on (pd);
}

static EVENT_DATA io_cpu_power_domain_implementation_t
serial_power_domain_implementation = {
	.turn_off = io_power_domain_no_operation,
	.turn_on = turn_serial_power_domain_on,
};

EVENT_DATA io_cpu_power_domain_implementation_t
vims_power_domain_implementation = {
	.turn_off = io_power_domain_no_operation,
	.turn_on = io_power_domain_no_operation,
};

EVENT_DATA io_cc2652_cpu_power_domain_t always_on_power_domain = {
	.implementation = &cpu_core_power_domain_implementation,
	.prcm_domain_identifier = 0, // none
};

EVENT_DATA io_cc2652_cpu_power_domain_t cpu_core_power_domain = {
	.implementation = &cpu_core_power_domain_implementation,
	.prcm_domain_identifier = PRCM_DOMAIN_MCU, //
};

io_cc2652_cpu_power_domain_t peripheral_power_domain = {
	.implementation = &peripheral_power_domain_implementation,
	.prcm_domain_identifier = PRCM_DOMAIN_PERIPH,
};

io_cc2652_cpu_power_domain_t serial_power_domain = {
	.implementation = &serial_power_domain_implementation,
	.prcm_domain_identifier = PRCM_DOMAIN_SERIAL,
};

//
// clocks
//

static bool
cc2652_hf_rc_oscillator_start (io_t *io,io_cpu_clock_pointer_t this) {
	return true;
}

static float64_t
cc2652_hf_rc_48_oscillator_get_current_frequency (io_cpu_clock_pointer_t this) {
	return 48000000.0;
}

//
// oscillators seem to be outside any power domain
//
EVENT_DATA io_cpu_clock_implementation_t
cc2652_hf_rc_48_oscillator_implementation = {
	.specialisation_of = &io_cpu_clock_implementation,
	.get_current_frequency = cc2652_hf_rc_48_oscillator_get_current_frequency,
	.get_expected_frequency = cc2652_hf_rc_48_oscillator_get_current_frequency,
	.get_power_domain = get_always_on_io_power_domain,
	.start = cc2652_hf_rc_oscillator_start,
	.stop = NULL,
};

static float64_t
cc2652_hf_rc_24_oscillator_get_current_frequency (io_cpu_clock_pointer_t this) {
	return 24000000.0;
}

EVENT_DATA io_cpu_clock_implementation_t
cc2652_hf_rc_24_oscillator_implementation = {
	.specialisation_of = &io_cpu_clock_implementation,
	.get_current_frequency = cc2652_hf_rc_24_oscillator_get_current_frequency,
	.get_expected_frequency = cc2652_hf_rc_24_oscillator_get_current_frequency,
	.get_power_domain = get_always_on_io_power_domain,
	.start = cc2652_hf_rc_oscillator_start,
	.stop = NULL,
};

static float64_t
cc2652_hp_oscillator_get_current_frequency (io_cpu_clock_pointer_t this) {
	cc2652_hp_oscillator_t const *c = (cc2652_hp_oscillator_t const*) (
		io_cpu_clock_ro_pointer (this)
	);
	return c->frequency;
}

//
// oscilator registers are accessed via this DDI thing
//
static bool
cc2652_hp_oscillator_start (io_t *io,io_cpu_clock_pointer_t this) {
		
	return OSC_IsHPOSCEnabled();
/*		

 
	if (!OSC_IsHPOSCEnabled()) {
		
		OSC_HPOSCInitializeFrequencyOffsetParameters ();

		
