abstractsig/io_cc2652/io_cpu.h
		return true;
	}
	
	return false;
*/
}

EVENT_DATA io_cpu_clock_implementation_t cc2652_hp_oscillator_implementation = {
	.specialisation_of = &io_cpu_clock_implementation,
	.get_current_frequency = cc2652_hp_oscillator_get_current_frequency,
	.get_expected_frequency = cc2652_hp_oscillator_get_current_frequency,
	.get_power_domain = get_always_on_io_power_domain,
	.start = cc2652_hp_oscillator_start,
	.stop = NULL,
};

bool
cc2652_clock_is_hp_oscillator (io_cpu_clock_pointer_t clock) {
	return io_cpu_clock_has_implementation (clock,&cc2652_hp_oscillator_implementation);
}

static float64_t
cc2652_sclk_lf_get_current_frequency (io_cpu_clock_pointer_t this) {
	cc2652_sclk_lf_t const *c = (cc2652_sclk_lf_t const*) (
		io_cpu_clock_ro_pointer (this)
	);
	return io_cpu_clock_get_current_frequency (c->input);
}

static bool
cc2652_sclk_lf_start (io_t *io,io_cpu_clock_pointer_t clock) {
	if (io_cpu_dependant_clock_start_input (io,clock)) {
		cc2652_sclk_lf_t const *this = (cc2652_sclk_lf_t const*) (
			io_cpu_clock_ro_pointer (clock)
		);
	
		// need to use DDI_0_OSC_CTL0_SCLK_LF_SRC_SEL to select
		// connect input clock configuration

		if (cpu_clock_is_cc2652_hf_rc_oscillator (this->input)) {
			OSCClockSourceSet (OSC_SRC_CLK_LF,OSC_RCOSC_HF);
//			HWREG (AUX_DDI0_OSC_BASE + DDI_0_OSC_O_CTL0) &= ~DDI_0_OSC_CTL0_SCLK_LF_SRC_SEL_M;
//			HWREG (AUX_DDI0_OSC_BASE + DDI_0_OSC_O_CTL0) |= DDI_0_OSC_CTL0_SCLK_LF_SRC_SEL_RCOSCHFDLF;
		} else if (cpu_clock_is_cc2652_hp_oscillator (this->input)) {
			OSCClockSourceSet (OSC_SRC_CLK_LF,OSC_XOSC_HF);
		} else {
			return false;
		}
		
		return true;
	} else {
		return false;
	}
}

EVENT_DATA io_cpu_clock_implementation_t cc2652_sclk_lf_implementation = {
	.specialisation_of = &io_cpu_clock_implementation,
	.get_current_frequency = cc2652_sclk_lf_get_current_frequency,
	.get_expected_frequency = cc2652_sclk_lf_get_current_frequency,
	.get_power_domain = get_always_on_io_power_domain,
	.start = cc2652_sclk_lf_start,
	.stop = NULL,
};

static float64_t
cc2652_core_clock_get_current_frequency (io_cpu_clock_pointer_t clock) {
	cc2652_core_clock_t const *this = (cc2652_core_clock_t const*) (
		io_cpu_clock_ro_pointer (clock)
	);
	return io_cpu_clock_get_current_frequency (this->input);
}

static bool
cc2652_core_clock_start (io_t *io,io_cpu_clock_pointer_t clock) {
	if (io_cpu_dependant_clock_start_input (io,clock)) {
		cc2652_sclk_lf_t const *this = (cc2652_sclk_lf_t const*) (
			io_cpu_clock_ro_pointer (clock)
		);

		if (cpu_clock_is_cc2652_hf_rc_oscillator (this->input)) {
			OSCClockSourceSet(OSC_SRC_CLK_HF,OSC_RCOSC_HF);
			//or OSCHF_SwitchToRcOscTurnOffXosc().
		} else if (cpu_clock_is_cc2652_hp_oscillator (this->input)) {
			OSCClockSourceSet(OSC_SRC_CLK_HF,OSC_XOSC_HF);
			while (!OSCHfSourceReady());
			OSCHfSourceSwitch();
		} else {
			return false;
		}
		return true;
	} else {
		return false;
	}
}

static io_cpu_power_domain_pointer_t
cc2652_core_clock_get_power_domain (io_cpu_clock_pointer_t clock) {
	return def_io_cpu_power_domain_pointer (&cpu_core_power_domain);
}

EVENT_DATA io_cpu_clock_implementation_t cc2652_core_clock_implementation = {
	.specialisation_of = &io_cpu_clock_implementation,
	.get_current_frequency = cc2652_core_clock_get_current_frequency,
	.get_expected_frequency = cc2652_core_clock_get_current_frequency,
	.get_power_domain = cc2652_core_clock_get_power_domain,
	.start = cc2652_core_clock_start,
	.stop = NULL,
};

static bool
cc2652_peripheral_clock_start (io_t *io,io_cpu_clock_pointer_t clock) {
	if (io_cpu_dependant_clock_start_input (io,clock)) {
		cc2652_peripheral_clock_t const *this = (cc2652_peripheral_clock_t const*) (
			io_cpu_clock_ro_pointer (clock)
		);

		turn_on_io_power_domain (io,io_cpu_clock_power_domain (clock));

		PRCMPeripheralRunEnable(this->prcm_peripheral_id);
		PRCMLoadSet();
		
		return true;
	} else {
		return false;
	}
}

static io_cpu_power_domain_pointer_t
cc2652_peripheral_clock_get_power_domain (io_cpu_clock_pointer_t clock) {
	return def_io_cpu_power_domain_pointer (&peripheral_power_domain);
}

EVENT_DATA io_cpu_clock_implementation_t cc2652_peripheral_clock_implementation = {
	.specialisation_of = &io_cpu_clock_implementation,
	.get_current_frequency = io_dependant_cpu_clock_get_current_frequency,
	.get_expected_frequency = io_dependant_cpu_clock_get_current_frequency,
	.get_power_domain = cc2652_peripheral_clock_get_power_domain,
	.start = cc2652_peripheral_clock_start,
	.stop = NULL,
};

static io_cpu_power_domain_pointer_t
cc2652_serial_clock_get_power_domain (io_cpu_clock_pointer_t clock) {
	return def_io_cpu_power_domain_pointer (&serial_power_domain);
}

EVENT_DATA io_cpu_clock_implementation_t cc2652_serial_clock_implementation = {
	.specialisation_of = &io_cpu_clock_implementation,
	.get_current_frequency = io_dependant_cpu_clock_get_current_frequency,
	.get_expected_frequency = io_dependant_cpu_clock_get_current_frequency,
	.get_power_domain = cc2652_serial_clock_get_power_domain,
	.start = cc2652_peripheral_clock_start,
	.stop = NULL,
};

static float64_t
cc2652_rtc_clock_get_current_frequency (io_cpu_clock_pointer_t clock) {
	cc2652_rtc_clock_t const *this = (cc2652_rtc_clock_t const*) (
		io_cpu_clock_ro_pointer (clock)
	);
	return io_cpu_clock_get_current_frequency (this->input);
}

static bool
cc2652_rtc_clock_start (io_t *io,io_cpu_clock_pointer_t clock) {
	if (io_cpu_dependant_clock_start_input (io,clock)) {
		return true;
	} else {
		return false;
	}
}

EVENT_DATA io_cpu_clock_implementation_t cc2652_rtc_clock_implementation = {
	.specialisation_of = &io_cpu_clock_implementation,
	.get_current_frequency = cc2652_rtc_clock_get_current_frequency,
	.get_expected_frequency = cc2652_rtc_clock_get_current_frequency,
	.get_power_domain = get_always_on_io_power_domain,
	.start = cc2652_rtc_clock_start,
	.stop = NULL,
};


//
// pins
//

static void
cc2652_write_to_io_pin (io_t *io,io_pin_t rpin,int32_t state) {
	cc2652_io_pin_t pin = {rpin};
	if (state ^ cc2652_io_pin_active_level (pin)) {
		 GPIO_writeDio (cc2652_io_pin_number(pin),0);
	} else {
		 GPIO_writeDio (cc2652_io_pin_number(pin),1);
	}
}

static void
cc2652_toggle_io_pin (io_t *io,io_pin_t rpin) {
	cc2652_io_pin_t pin = {rpin};
	GPIO_toggleDio(cc2652_io_pin_number(pin));
}

