abstractsig/io_cc2652/io_cpu.h
static int32_t
cc2652_read_io_input_pin (io_t *io,io_pin_t rpin) {
	cc2652_io_pin_t pin = {rpin};
	return GPIO_readDio(cc2652_io_pin_number(pin));
}

static void
cc2652_configure_io_pin_as_output (cc2652_io_pin_t pin) {
	IOCIOPortPullSet (cc2652_io_pin_number(pin),IOC_NO_IOPULL);
	IOCPinTypeGpioOutput(cc2652_io_pin_number(pin));
}

void
cc2652_configure_io_pin_as_input (cc2652_io_pin_t pin) {
	switch (cc2652_io_pin_pull_mode(pin)) {
		case IO_PIN_NO_PULL:
			IOCIOPortPullSet (cc2652_io_pin_number(pin),IOC_NO_IOPULL);
		break;
		
		case IO_PIN_PULL_UP:
			IOCIOPortPullSet (cc2652_io_pin_number(pin),IOC_IOPULL_UP);
		break;
		
		case IO_PIN_PULL_DOWN:
			IOCIOPortPullSet (cc2652_io_pin_number(pin),IOC_IOPULL_DOWN);
		break;
	}
	IOCPinTypeGpioInput(cc2652_io_pin_number(pin));
}

static void
cc2652_configure_io_pin_as_alternate (cc2652_io_pin_t pin) {
	IOCPortConfigureSet (
		cc2652_io_pin_number (pin),
		cc2652_io_pin_ioc_port_id (pin),
		(
				IOC_NO_IOPULL
			|	0
		)
	);
}

//
// sockets
//

bool
UARTisEnabled (uint32_t ui32Base) {
	return (HWREG(ui32Base + UART_O_CTL) & UART_CTL_UARTEN) != 0;
}

static bool
cc2652_uart_output_next_buffer (cc2652_uart_t *this) {
	io_encoding_t *next;
	if (
			UARTisEnabled (this->register_base_address)
		&& io_encoding_pipe_peek (this->tx_pipe,&next)
	) {
		const uint8_t *byte,*end;
		io_encoding_get_ro_bytes (next,&byte,&end);
		
		while (byte < end) {
			UARTCharPut (this->register_base_address,*byte++);
		}
		
		io_enqueue_event (this->io,&this->transmit_complete);
		return true;
	} else {
		return false;
	}
}

static void
cc2652_uart_output_event_handler (io_event_t *ev) {
	cc2652_uart_t *this = ev->user_value;
	io_encoding_t *next;
	
	if (io_encoding_pipe_get_encoding (this->tx_pipe,&next)) {
		unreference_io_encoding (next);
	} else {
		io_panic (this->io,IO_PANIC_SOMETHING_BAD_HAPPENED);
	}
	
	if (
			!cc2652_uart_output_next_buffer (this)
		&&	UARTisEnabled (this->register_base_address)
		&& io_event_is_valid (io_pipe_event (this->tx_pipe))
	) {
		io_enqueue_event (this->io,io_pipe_event (this->tx_pipe));
	}
}

void
cc2652_uart_interrupt (void *user_value) {
	cc2652_uart_t *this = user_value;
	uint32_t status = HWREG(this->register_base_address + UART_O_MIS);

	if (status & ( UART_MIS_RTMIS | UART_MIS_RXMIS)) {		
		// clear interrupt
		HWREG (this->register_base_address + UART_O_ICR) &= ~UART_ICR_RXIC;

		while (!(HWREG(this->register_base_address + UART_O_FR) & UART_FR_RXFE)) {
			uint8_t byte = HWREG (this->register_base_address + UART_O_DR);
			io_byte_pipe_put_byte (this->rx_pipe,byte);
		}
		io_enqueue_event (this->io,io_pipe_event (this->rx_pipe));
	}

	if (status & UART_MIS_TXMIS) {		
		// clear interrupt
		HWREG (this->register_base_address + UART_O_ICR) &= ~UART_ICR_TXIC;
/*
		while (!(HWREG(base + UART_O_FR) & UART_FR_TXFF)) {
			if (!pipe_get_element (this->tx_buffer,byte)) {
				// tx done, disable tx interrupt
				HWREG (base + UART_O_IMSC) &= ~UART_IMSC_TXIM;
				ccm3_uart_tx_is_busy (this) = 0;
				break;
			}
		}
*/
	}

	if (HWREG(this->register_base_address + UART_O_MIS) != 0) {
		//panic("uart error");
	}

}

// has 32byte rx and tx fifos
static io_socket_t*
cc2652_uart_initialise (
	io_socket_t *socket,io_t *io,io_socket_constructor_t const *C
) {
	cc2652_uart_t *this = (cc2652_uart_t*) socket;
	this->io = io;

	this->tx_pipe = mk_io_encoding_pipe (io_get_byte_memory(io),C->transmit_pipe_length);
	//initialise_io_event (&this->signal_transmit_available,NULL,this);

	this->rx_pipe = mk_io_byte_pipe (
		io_get_byte_memory(io),io_socket_constructor_receive_pipe_length(C)
	);

	initialise_io_event (
		&this->transmit_complete,cc2652_uart_output_event_handler,this
	);

	// enable interrupts
	
	register_io_interrupt_handler (
		io,this->interrupt_number,cc2652_uart_interrupt,this
	);
	
	return socket;
}

static io_t*
cc2652_uart_get_io (io_socket_t *socket) {
	cc2652_uart_t *this = (cc2652_uart_t*) socket;
	return this->io;
}

void
cc2652_uart_set_baud_rate (cc2652_uart_t *this) {
	
	float64_t freq = io_cpu_clock_get_current_frequency (this->peripheral_clock);
	uint32_t clock = (uint32_t) freq;
	uint32_t base = this->register_base_address;
	uint32_t div = (((clock * 8) / this->baud_rate) + 1) / 2;//(clock << 6) / (this->baud_rate * 16);
	
	HWREG(base + UART_O_IBRD) = div / 64;
	HWREG(base + UART_O_FBRD) = div % 64;
}

#define UART_LCRH_STP1 0
#define UART_LCRH_NO_PARITY 0

static bool
cc2652_uart_open (io_socket_t *socket) {
	cc2652_uart_t *this = (cc2652_uart_t*) socket;
	
	if (io_cpu_clock_start (this->io,this->peripheral_clock)) {
		if (!UARTisEnabled (this->register_base_address)) {
		
			io_set_pin_to_output (this->io,this->tx_pin.io);
			io_set_pin_to_alternate (this->io,this->tx_pin.io);
			io_set_pin_to_input (this->io,this->rx_pin.io);
			io_set_pin_to_alternate (this->io,this->rx_pin.io);
			
			cc2652_uart_set_baud_rate (this);
			HWREG(this->register_base_address + UART_O_LCRH) = (
					UART_LCRH_WLEN_8
				|	UART_LCRH_STP1
				|	UART_LCRH_NO_PARITY
			);

			/*
			HWREG(this->register_base_address + UART_O_IFLS) = (
					UART_IFLS_RXSEL_7_8
				|	UART_IFLS_TXSEL_1_8
			);
			*/
			
			HWREG (this->register_base_address + UART_O_IMSC) |= (
					UART_IMSC_RXIM
			//	|	UART_IMSC_TXIM
			);
			
			// see UART_O_DMACTL
			
			UARTEnable (this->register_base_address);
			
			{
				int32_t irqn = CMSIS_IRQn(this->interrupt_number);
				NVIC_SetPriority (irqn,NORMAL_INTERRUPT_PRIORITY);
				NVIC_ClearPendingIRQ (irqn);
				NVIC_EnableIRQ (irqn);
			}
		}
		return true;
	}

	return false;
}

static void
cc2652_uart_close (io_socket_t *socket) {
}

static io_event_t*
cc2652_uart_bindr (io_socket_t *socket,io_event_t *rx) {
	return NULL;
}

static io_pipe_t*
cc2652_uart_bindt (io_socket_t *socket,io_event_t *ev) {
	return NULL;
}

static io_encoding_t*
cc2652_uart_new_message (io_socket_t *socket) {
	cc2652_uart_t *this = (cc2652_uart_t*) socket;
	return reference_io_encoding (
		new_io_encoding (this->encoding,io_get_byte_memory(this->io))
	);
}

static bool
cc2652_uart_send_message (io_socket_t *socket,io_encoding_t *encoding) {
	if (is_io_binary_encoding (encoding)) {
		cc2652_uart_t *this = (cc2652_uart_t*) socket;
		if (io_encoding_pipe_put_encoding (this->tx_pipe,encoding)) {
			if (io_encoding_pipe_count_occupied_slots (this->tx_pipe) == 1) {
				cc2652_uart_output_next_buffer (this);
			}
			return true;
		} else {
			unreference_io_encoding (encoding);
			return false;
		}
	} else {
		return false;
	}
}

