abstractsig/io_cc2652/io_cpu.h
static size_t
cc2652_uart_mtu (io_socket_t const *socket) {
	return 1024;
}	

EVENT_DATA io_socket_implementation_t cc2652_uart_implementation = {
	.specialisation_of = NULL,
	.initialise = cc2652_uart_initialise,
	.free = NULL,
	.get_io = cc2652_uart_get_io,
	.open = cc2652_uart_open,
	.close = cc2652_uart_close,
	.bindr = cc2652_uart_bindr,
	.bindt = cc2652_uart_bindt,
	.new_message = cc2652_uart_new_message,
	.send_message = cc2652_uart_send_message,
	.iterate_inner_sockets = NULL,
	.iterate_outer_sockets = NULL,
	.mtu = cc2652_uart_mtu,
};


io_time_t
cc2652_time_clock_get_time (io_t *io,cc2652_time_clock_t *rtc) {	
	int64_t sec,frac;
	
	{
		bool h = enter_io_critical_section (io);
		sec = AONRTCSecGet ();
		frac = AONRTCFractionGet ();
		
		exit_io_critical_section (io,h);
	}
	//
	// q32.32
	// fraction part is 1000000000/(1 << 32) = 0.2328 ns per unit
	// multiply by (1 << 16) to use integer multiplication
	//
	return (io_time_t) {
		.nanoseconds = (sec * 1000000000LL) + ((frac * 15259LL) >> 16LL),
	};
};

//
// expects next alarm time to be greater than current time
//
static bool
set_time_clock_alarm_time (io_cc2652_cpu_t *this) {
	if (this->alarms != &s_null_io_alarm) {
		uint32_t sec = this->alarms->when.ns/1000000000LL;
		uint32_t frac = ((this->alarms->when.ns - (sec * 1000000000LL)) * 281474LL) >> 16;
		
		AONRTCCompareValueSet (
			AON_RTC_CH0,
			((sec & 0xffff) << 16L) + ((frac & 0xffff0000) >> 16)
		);
		
		return true;
	} else {
		return false;
	}
}

static bool
process_next_alarm (io_cc2652_cpu_t *this) {
	if (this->alarms != &s_null_io_alarm) {
		volatile io_time_t t = cc2652_time_clock_get_time ((io_t*) this,&this->rtc);
		
		if (t.ns >= this->alarms->when.ns) {
			io_alarm_t *alarm = this->alarms;
			this->alarms = this->alarms->next_alarm;
			alarm->next_alarm = NULL;
			alarm->at->event_handler (alarm->at);		
			//
			// add tollerance check ...
			//
			return true;
		} else {
			//while(1) {}
		}
	}
	return false;
}

static void
process_alarm_queue (io_event_t *ev) {
	io_cc2652_cpu_t *this = ev->user_value;
	uint32_t count = 0;
	
	while (process_next_alarm (this)) {
		count++;
	}
	
	if (count) {
		set_time_clock_alarm_time (this);
	}
}

void
cc2652_time_clock_interrupt (void *user_value) {
	io_cc2652_cpu_t *this = user_value;
	AONRTCEventClear(AON_RTC_CH0);
	io_enqueue_event (user_value,&this->rtc.alarm);
}

static void
start_time_clock (io_cc2652_cpu_t *this) {

	this->rtc.io = (io_t*) this;
	
	if (io_cpu_clock_start ((io_t*) this,this->rtc.clock)) {

		AONRTCReset();
		
		AONRTCDelayConfig (AON_RTC_CONFIG_DELAY_NODELAY);

		// compare channel 0, will also wakeup the cpu core
		AONEventMcuWakeUpSet(AON_EVENT_MCU_WU0, AON_EVENT_RTC0);
		
		AONRTCChannelEnable(AON_RTC_CH0);
		AONRTCCombinedEventConfig(AON_RTC_CH0);

		AONRTCEnable ();

		SysCtrlAonSync ();
		
		initialise_io_event (&this->rtc.alarm,process_alarm_queue,this);
		
		register_io_interrupt_handler (
			(io_t*) this,INT_AON_RTC_COMB,cc2652_time_clock_interrupt,this
		);

		{
			int32_t irqn = CMSIS_IRQn(INT_AON_RTC_COMB);
			NVIC_SetPriority (irqn,NORMAL_INTERRUPT_PRIORITY);
			NVIC_EnableIRQ (irqn);
		}
		
	}
}

static io_time_t
cc2652_get_time (io_t *io) {
	io_cc2652_cpu_t *this = (io_cc2652_cpu_t*) io;
	return cc2652_time_clock_get_time (io,&this->rtc);
}

//
// io methods
//
static io_byte_memory_t*
cc2652_io_get_byte_memory (io_t *io) {
	io_cc2652_cpu_t *this = (io_cc2652_cpu_t*) io;
	return this->bm;
}

static io_value_memory_t*
cc2652_io_get_stvm (io_t *io) {
	io_cc2652_cpu_t *this = (io_cc2652_cpu_t*) io;
	return this->vm;
}

static void
cc2652_do_gc (io_t *io,int32_t count) {
	io_value_memory_do_gc (io_get_short_term_value_memory (io),count);
}

static void
cc2652_signal_task_pending (io_t *io) {
	// no action required
}

static void
cc2652_signal_event_pending (io_t *io) {
	SCB->ICSR |= SCB_ICSR_PENDSVSET_Msk;
}

static bool
cc2652_enqueue_task (io_t *io,vref_t r_task) {
	io_cc2652_cpu_t *this = (io_cc2652_cpu_t*) io;
	return io_value_pipe_put_value (this->tasks,r_task);
}

static bool
cc2652_do_next_task (io_t *io) {
	io_cc2652_cpu_t *this = (io_cc2652_cpu_t*) io;
	vref_t r_task;
	if (io_value_pipe_get_value (this->tasks,&r_task)) {
		vref_t const *argv;
		uint32_t argc;
		
		if (io_vector_value_get_values (r_task,&argc,&argv)) {
			
			// ...
		
			return true;
		}
	}
	return false;
}

static bool
cc2652_enter_critical_section (io_t *env) {
	uint32_t interrupts_are_enabled = !(__get_PRIMASK() & 0x1);
	DISABLE_INTERRUPTS;
	return interrupts_are_enabled;
}

void
cc2652_exit_critical_section (io_t *env,bool were_enabled) {
	if (were_enabled) {
		ENABLE_INTERRUPTS;
	}
}

static bool
cc2652_is_in_event_thread (io_t *io) {
	return ((io_cc2652_cpu_t*) io)->in_event_thread;
}

static void
cc2652_wait_for_event (io_t *io) {
	__WFI();
}

static void
cc2652_for_all_events (io_t *io) {
	io_event_t *event;
	io_alarm_t *alarm;
	do {
		ENTER_CRITICAL_SECTION(io);
		event = io->events;
		alarm = io->alarms;
		EXIT_CRITICAL_SECTION(io);
	} while (
			event != &s_null_io_event
		&&	alarm != &s_null_io_alarm
	);
}

static void	
cc2652_register_interrupt_handler (
	io_t *io,int32_t number,io_interrupt_action_t handler,void *user_value
) {
	io_interrupt_handler_t *i = cpu_interrupts + number;
	i->action = handler;
	i->user_value = user_value;
}

static bool	
cc2652_unregister_interrupt_handler (
	io_t *io,int32_t number,io_interrupt_action_t handler
) {
	io_interrupt_handler_t *i = cpu_interrupts + number;
	if (i->action == handler) {
		i->action = null_interrupt_handler;
		i->user_value = io;
		return true;
	} else {
		return false;
	}
}

//
// need power domain and clock enabled ...
// same for all pins
//
static void
cc2652_start_gpio_clock (io_t *io) {
	io_cc2652_cpu_t *this = (io_cc2652_cpu_t*) io;
	io_cpu_clock_start (io,this->gpio_clock);
}

static void
cc2652_set_io_pin_to_output (io_t *io,io_pin_t rpin) {
	cc2652_io_pin_t pin = {rpin};
	cc2652_start_gpio_clock (io);
	cc2652_write_to_io_pin (io,rpin,cc2652_io_pin_initial_state(pin));	
	cc2652_configure_io_pin_as_output (pin);
}

static void
cc2652_set_io_pin_to_input (io_t *io,io_pin_t rpin) {
	cc2652_io_pin_t pin = {rpin};
	cc2652_start_gpio_clock (io);
	cc2652_configure_io_pin_as_input (pin);
}

static void
cc2652_set_io_pin_to_alternate (io_t *io,io_pin_t rpin) {
	cc2652_io_pin_t pin = {rpin};
	cc2652_start_gpio_clock (io);
	cc2652_configure_io_pin_as_alternate (pin);
}

//
// so we can turn clock and power off
//
static void
cc2652_release_io_pin (io_t *io,io_pin_t rpin) {
}

static bool
cc2652_io_pin_is_valid (io_t *io,io_pin_t rpin) {
	cc2652_io_pin_t pin = {rpin};
	return cc2652_io_pin_number(pin) != CC2652_INVALID_PIN_NUMBER;
}

static void
cc2652_set_io_pin_interrupt (io_t *io,io_pin_t rpin,io_interrupt_handler_t *h) {
/*
	switch (base3_gpio_pin_config_interrupt(pin)) {
	  case GPIO_INTERRUPT_RISING:
			IOCIOIntSet (
				 base3_gpio_pin_config_number(pin),IOC_INT_ENABLE,IOC_RISING_EDGE
			);
	  break;
	  case GPIO_INTERRUPT_FALLING:
			IOCIOIntSet (
				 base3_gpio_pin_config_number(pin),IOC_INT_ENABLE,IOC_FALLING_EDGE
			);
	  break;
	  case GPIO_INTERRUPT_BOTH:
			IOCIOIntSet (
				 base3_gpio_pin_config_number(pin),IOC_INT_ENABLE,IOC_BOTH_EDGES
			);
	  break;
	}
*/
}

