abstractsig/io_cc2652/io_cpu.h
INLINE_FUNCTION uint32_t prbs_rotl(const uint32_t x, int k) {
	return (x << k) | (x >> (32 - k));
}

static uint32_t
cc2652_get_prbs_random_u32 (io_t *io) {
	io_cc2652_cpu_t *this = (io_cc2652_cpu_t*) io;
	uint32_t *s = this->prbs_state;
	const uint32_t result = prbs_rotl (s[0] + s[3], 7) + s[0];

	const uint32_t t = s[1] << 9;

	s[2] ^= s[0];
	s[3] ^= s[1];
	s[1] ^= s[2];
	s[0] ^= s[3];

	s[2] ^= t;

	s[3] = prbs_rotl (s[3], 11);

	return result;
}

static void
cc2652_time_clock_enqueue_alarm (io_t *io,io_alarm_t *alarm) {
	io_cc2652_cpu_t *this = (io_cc2652_cpu_t*) io;
	
	ENTER_CRITICAL_SECTION(io);

	if (alarm->when.ns < this->alarms->when.ns) {
		alarm->next_alarm = this->alarms;
		this->alarms = alarm;
		if (!set_time_clock_alarm_time (this)) {
			io_panic (io,IO_PANIC_TIME_CLOCK_ERROR);
		}
	} else {
		io_alarm_t *pre = this->alarms;
		while (alarm->when.ns > pre->when.ns) {
			if (pre->next_alarm == &s_null_io_alarm) {
				break;
			}
			pre = pre->next_alarm;
		}
		alarm->next_alarm = pre->next_alarm;
		pre->next_alarm = alarm;
	}

	EXIT_CRITICAL_SECTION(io);
}

static void
cc2652_time_clock_dequeue_alarm (io_t *io,io_alarm_t *alarm) {
	if (alarm->next_alarm != NULL) {
		ENTER_CRITICAL_SECTION (io);
		if (alarm == io->alarms) {
			io_cc2652_cpu_t *this = (io_cc2652_cpu_t*) io;
			io->alarms = io->alarms->next_alarm;
			set_time_clock_alarm_time (this);
		} else {
			io_alarm_t *pre = io->alarms;
			while (pre) {
				if (alarm == pre->next_alarm) {
					pre->next_alarm = alarm->next_alarm;
					break;
				}
				pre = pre->next_alarm;
			}
		}
		alarm->next_alarm = NULL;
		EXIT_CRITICAL_SECTION (io);
	}
}

static void
cc2652_panic (io_t *io,int code) {
	DISABLE_INTERRUPTS;
	while (1);
}

static void
cc2652_log (io_t *io,char const *fmt,va_list va) {
	// ...
}

void
add_io_implementation_cpu_methods (io_implementation_t *io_i) {
	add_io_implementation_core_methods (io_i);

	io_i->get_byte_memory = cc2652_io_get_byte_memory;
	io_i->get_short_term_value_memory = cc2652_io_get_stvm;
	io_i->do_gc = cc2652_do_gc;
	io_i->is_first_run = cc2652_is_first_run;
	io_i->uid = cc2652_get_uid;
	io_i->do_gc = cc2652_do_gc;
	io_i->get_next_prbs_u32 = cc2652_get_prbs_random_u32;
	io_i->signal_task_pending = cc2652_signal_task_pending;
	io_i->enqueue_task = cc2652_enqueue_task;
	io_i->do_next_task = cc2652_do_next_task;
	io_i->signal_event_pending = cc2652_signal_event_pending;
	io_i->enter_critical_section = cc2652_enter_critical_section;
	io_i->exit_critical_section = cc2652_exit_critical_section;
	io_i->in_event_thread = cc2652_is_in_event_thread;
	io_i->wait_for_event = cc2652_wait_for_event;
	io_i->get_time = cc2652_get_time,
	io_i->enqueue_alarm = cc2652_time_clock_enqueue_alarm;
	io_i->dequeue_alarm = cc2652_time_clock_dequeue_alarm;
	io_i->register_interrupt_handler = cc2652_register_interrupt_handler;
	io_i->unregister_interrupt_handler = cc2652_unregister_interrupt_handler;
	io_i->wait_for_all_events = cc2652_for_all_events;
	io_i->set_io_pin_output = cc2652_set_io_pin_to_output,
	io_i->set_io_pin_input = cc2652_set_io_pin_to_input,
	io_i->set_io_pin_alternate = cc2652_set_io_pin_to_alternate,
	io_i->set_io_pin_interrupt = cc2652_set_io_pin_interrupt,
	io_i->read_from_io_pin = cc2652_read_io_input_pin,
	io_i->write_to_io_pin = cc2652_write_to_io_pin,
	io_i->toggle_io_pin = cc2652_toggle_io_pin,
	io_i->valid_pin = cc2652_io_pin_is_valid,
	io_i->release_io_pin = cc2652_release_io_pin,
	io_i->panic = cc2652_panic;
	io_i->log = cc2652_log;
}

static void
event_thread (void *io) {
	io_cc2652_cpu_t *this = io;
	this->in_event_thread = true;
	while (next_io_event (io));
	this->in_event_thread = false;
}

static void
hard_fault (void *io) {
	DISABLE_INTERRUPTS;
	while(1);
}

void
initialise_cpu_io (io_t *io) {
	io_cc2652_cpu_t *this = (io_cc2652_cpu_t*) io;

	this->in_event_thread = false;
	this->first_run = cc2652_io_config_is_first_run ();
	
	io_cpu_clock_start (io,io_get_core_clock(io));

	register_io_interrupt_handler (io,INT_PENDSV,event_thread,io);
	register_io_interrupt_handler (io,INT_HARD_FAULT,hard_fault,io);

	start_time_clock (this);
	
	this->prbs_state[0] = io_get_random_u32(io);
	this->prbs_state[1] = 0xf542d2d3;
	this->prbs_state[2] = 0x6fa035c3;
	this->prbs_state[3] = 0x77f2db5b;
}

static void
initialise_ram_interrupt_vectors (void) {
	io_interrupt_handler_t *i = cpu_interrupts;
	io_interrupt_handler_t *e = i + NUMBER_OF_INTERRUPT_VECTORS;
	while (i < e) {
		i->action = null_interrupt_handler;
		i->user_value = NULL;
		i++;
	}
}

static void
initialise_c_runtime (void) {
	extern uint32_t ld_start_of_sdata_in_flash;
	extern uint32_t ld_start_of_sdata_in_ram,ld_end_of_sdata_in_ram;
	extern uint32_t ld_start_of_bss,ld_end_of_bss;

	uint32_t *src = &ld_start_of_sdata_in_flash;
	uint32_t *dest = &ld_start_of_sdata_in_ram;

	while(dest < &ld_end_of_sdata_in_ram) *dest++ = *src++;
	dest = &ld_start_of_bss;
	while(dest < &ld_end_of_bss) *dest++ = 0;

	// fill stack/heap region of RAM with a pattern
	extern uint32_t ld_end_of_static_ram_allocations;
	uint32_t *end = (uint32_t*) __get_MSP();
	dest = &ld_end_of_static_ram_allocations;
	while (dest < end) {
		*dest++ = 0xdeadc0de;
	}
	
	initialise_ram_interrupt_vectors ();
}

static void
tune_cpu (void) {
	// see GPNVM, TCM is disabled?
	
	#if (__FPU_USED == 1)
	/* enable FPU if available and used */
	SCB->CPACR |= ((3UL << 10*2) |             /* set CP10 Full Access               */
					  (3UL << 11*2)  );           /* set CP11 Full Access               */
	#endif
}

int main(void);

void
cc2652_core_reset (void) {
	SetupTrimDevice();
	initialise_c_runtime ();
	tune_cpu ();
	main ();
	while (1);
}

static void
handle_io_cpu_interrupt (void) {
	io_interrupt_handler_t const *interrupt = &cpu_interrupts[
		SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk
	];
	interrupt->action(interrupt->user_value);
}

extern uint32_t ld_top_of_c_stack;
__attribute__ ((section(".isr_vector")))
const void* s_flash_vector_table[NUMBER_OF_INTERRUPT_VECTORS] = {
	&ld_top_of_c_stack,
	cc2652_core_reset,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,

